<?php

namespace App\Http\Controllers;

use Illuminate\Foundation\Bus\DispatchesJobs;
use Illuminate\Routing\Controller as BaseController;
use Illuminate\Foundation\Validation\ValidatesRequests;
use Illuminate\Foundation\Auth\Access\AuthorizesRequests;
use Auth;
use Redis;
use DB;
use App\User;
use App\Settings;
use Session;

class Controller extends BaseController
{
    use AuthorizesRequests, DispatchesJobs, ValidatesRequests;

    public function __construct()
    {
        if(Auth::check()) view()->share('u', Auth::user());
        view()->share('title', 'Title not set.');
        $this->redis = Redis::connection();
        $this->config = Settings::first();
    }

    public static function getLang()
    {
        $lang = Session::get('language', 'en');

        $list = [
            // RUSSIAN
            "ru" => [
                "achievement_unlock" => 'Заработано достижение : ',
                "lobby" => [
                    "license_title" => 'Пользовательское соглашение',
                    "license" => 'Данное Лицензионное соглашение конечного пользователя в редакции от 26.07.2017 г. (далее по тексту «Соглашение») должно быть полностью прочитано любым лицом (далее по тексту также «Пользователь») до начала использования им сервисов, ресурсов и инструментов веб-сайта http://dotaregal.com/, содержащих совокупность данных, электронную (цифровую) информацию, а также иные объекты авторского права (далее вместе именованы «Проект»).<br>
            Соглашение устанавливает общие условия использования Проекта, гарантии Пользователей, режим конфиденциальности, а также исключительные права правообладателя Проекта (далее по тексту «dotaregal.com»).<br>
            Принимая данное Соглашение Пользователь (совершая акцепт путем нажатия кнопки «Принимаю») признает исключительное право dotaregal.com на Проект (как автора, так и собственника), кроме того осознает значение и контролирует свои действия, понимает смысл каждого пункта данного Соглашения, их юридическую значимость, необратимость последствий нарушения требований Соглашения, а также установленную за это ответственность, подтверждает нижеперечисленные гарантии и берет все риски использования Проекта на себя.<br><br>

            Общие положения предоставления Лицензии.<br>
            В соответствии с условиями настоящего Соглашения dotaregal.com предоставляет Пользователю неисключительное личное непередаваемое право на использование Проекта (сервисы, ресурсы и инструменты веб-сайта http://dotaregal.com/) с целью игры в ROULETTE, POKER или SLOT MACHINE. При этом Пользователь осведомлен, что ROULETTE, POKER и SLOT MACHINE являются неотъемлемыми частями веб-сайта http://dotaregal.com/, входят в состав Проекта, принадлежат dotaregal.com и охраняются авторским правом.<br>
            Лицензия на Проект предоставляется только совершеннолетнему Пользователю для частного индивидуального использования. При этом Проект не предназначен для использования лицами, не достигшими установленного законом совершеннолетнего возраста в соответствующей юрисдикции страны Пользователя. dotaregal.com не в состоянии установить возраст совершеннолетия лица в каждой юрисдикции, и выяснение этого вопроса является обязанностью Пользователя.<br>
            dotaregal.com сохраняет за собой право в любое время потребовать у Пользователя доказательства совершеннолетия, чтобы убедиться в том, что несовершеннолетние не пользуются Проектом.<br>
            dotaregal.com сохраняет за собой право временно отключить или аннулировать учетную запись Пользователя либо лишить Пользователя (временно или на постоянной основе) права использования Проекта, если dotaregal.com не будет предоставлено доказательство совершеннолетия или если у dotaregal.com возникнут подозрения, что Пользователь не достиг совершеннолетия.<br>
            Проект не предназначен для использования лицами, осуществляющими подключение к http://dotaregal.com/ из юрисдикций, в которых такое подключение является незаконным. dotaregal.com не в состоянии установить законность Проекта в каждой юрисдикции, и выяснение этого вопроса является обязанностью Пользователя.<br>
            dotaregal.com сохраняет за собой право временно отключить или аннулировать учетную запись Пользователя либо лишить Пользователя (временно или на постоянной основе) права использования Проекта, если у dotaregal.com не будет достаточных доказательств, подтверждающих законность подключения к http://dotaregal.com/ из юрисдикции Пользователя.<br>
            dotaregal.com является единственными владельцем всех прав на Проект, в том числе исходный код, структуру и организацию Проекта, сервисы - ROULETTE, POKER и SLOT MACHINE, совокупность данных, электронную (цифровую) информацию, включая авторские права, засекреченные технологии, интеллектуальную собственность и другие права. Действие данного пункта также распространяется на любые модификации Проекта, сервисов Проекта, осуществленные dotaregal.com в будущем.<br><br>
            Пользователь не вправе:<br>
            копировать, распространять, публиковать, декомпилировать, детранслировать, производить разборку, модифицировать или преобразовывать Проект (любую его составляющую), или совершать любые попытки получить доступ к исходному коду для создания производных программ (веб-сайтов, веб-страниц) на основе исходного кода Проекта или иным образом;<br>
            продавать, переуступать, сублицензировать, передавать, распространять или предоставлять Проект (любую его составляющую) во временное пользование;<br>
            предоставлять доступ к Проекту каким-либо третьим лицам по компьютерной сети или иным образом;<br>
            экспортировать Проект в какую-либо страну (как физически, так и электронными способами);<br>
            использовать Проект каким-либо способом, запрещенным действующими законами и нормативными документами (под действующим законодательством и нормативными документами следует понимать – законодательство Украины, а также международные договора, ратифицированные Украиной).<br>
            Ограничения, установленные п. 1.8. Соглашения не являются исчерпывающими и относятся к Несанкционированному использованию Проекта.<br>
            dotaregal.com сохраняет за собой все предполагаемые и иные права, которые явным образом не передаются Пользователю данным Соглашением.<br>
            Пользователь соглашается нести материальную ответственность за любой ущерб, затраты и расходы, возникающие в результате или в связи с любым совершенным им Несанкционированным использованием Проекта.<br>
            Пользователь обязан незамедлительно уведомлять dotaregal.com о каждом случае Несанкционированного использования Проекта каким-либо лицом, о котором ему стало известно, и оказывать dotaregal.com поддержку в любом расследовании, которое будет инициировано dotaregal.com в виду получения вышеуказанной информации.<br>
            Пользователь при использовании Проекта обязуется не предпринимать действий, которые могут нанести вред имиджу и репутации dotaregal.com.<br>
            Пользователь гарантирует, что использование им любых имен, изображений, иной информации, при пользовании Проектом (например, имя пользователя, аватар, контакты), не нарушают никаких прав на интеллектуальную собственность, прав на конфиденциальность и любых других прав какого-либо третьего лица.<br>
            Пользователь предоставляет dotaregal.com международное, безотзывное, подлежащее передаче, безвозмездное, подлежащее сублицензированию право на использование этих имен, изображений, иной информации о Пользователе в любых целях, связанных с Проектом, при условии выполнения условий политики конфиденциальности, установленной данным Соглашением.<br><br>

            Гарантии Пользователя. Ограничения dotaregal.com. До начала, а также на протяжении всего срока использования Проекта в личных целях согласно условиям данного Соглашения, Пользователь дает свое согласие, обязуется и гарантирует следующее:<br>
            Пользователь осознает в полном объеме, что при использовании Проекта, в части игры в ROULETTE, POKER и SLOT MACHINE, существует риск потери игровых монет, используемых в Проекте, а также игровых предметов, используемых в обороте сервиса цифрового распространения компьютерных игр и программ – «Steam». По данным фактам dotaregal.com не несет какой-либо ответственности перед Пользователем за какие-либо убытки. Риск потери игровых монет и игровых предметов полностью приемлем Пользователю.<br>
            Пользователь использует Проект по собственному желанию.<br>
            Пользователь при доступе к ресурсам Проекта использует проверенные интернет-сервисы проверенных поставщиков (провайдеров). При этом телекоммуникационные сети и интернет-сервисы, необходимые для получения Пользователем доступа к Проекту, абсолютно неподконтрольны dotaregal.com, поэтому dotaregal.com не несет ответственности за какие-либо отключения, низкую скорость, ограничения пропускной способности или другие проблемы.<br>
            Пользователь достиг совершеннолетия согласно установленного законом совершеннолетнего возраста в соответствующей юрисдикции страны Пользователя.<br>
            Пользователь дает свое согласие в соответствии с законодательством и для получения доступа к использованию ним всех ресурсов Проекта предоставить свои персональные данные dotaregal.com.<br>
            Пользователь разрешает dotaregal.com (и третьим лицам, действующим от имени dotaregal.com) получить доступ и/или использовать данные о местоположении Пользователя и/или другие необходимые данные для предоставления Пользователю ресурсов и функционала Проекта, а также информацию, которую можно косвенно получить об устройстве/компьютере Пользователя. При этом, Пользователь осознает, что ему запрещено использовать Проект, если он не хочет давать такое разрешение.<br>
            Пользователь принимая данное Соглашение соглашается с тем, что dotaregal.com отказывается от всех без исключения гарантий, прямо выраженных или подразумеваемых в связи с использованием Пользователем Проекта.<br>
            Пользователь согласен, что Проект предоставляется ему по принципу «КАК ЕСТЬ», и dotaregal.com не предоставляет Пользователю каких-либо гарантий или заверений в отношении качества Проекта, его соответствия назначению, полноты или точности, а также ожиданиям Пользователя. В тоже время в независимости от усилий dotaregal.com по предоставлению Пользователю Проекта, отвечающего самым высоким стандартам качества, надежности и безопасности, dotaregal.com не дает никаких гарантий, что Проект будет работать непрерывно, своевременно и без ошибок, а также что подобные дефекты будут исправлены или что Проект не будет содержать вирусы или ошибки.<br>
            Пользователь согласен, что dotaregal.com сохраняет за собой право приостанавливать, прекращать, изменять, добавлять, видоизменять или удалять Проект.<br>
            Пользователь обязуется использовать Проект только в индивидуальных целях, исключительно для личного развлечения. Ни при каких обстоятельствах Пользователь не вправе использовать свой профиль на Проекте для любой иной цели помимо установленной в данном Соглашении. За нарушение данного требования dotaregal.com сохраняет за собой право временно отключить или аннулировать учетную запись Пользователя либо лишить Пользователя (временно или на постоянной основе) права использования Проекта.<br>
            Пользователь обязуется не осуществлять каких-либо манипуляций с игровыми монетами, а также игровыми предметами сервиса цифрового распространения компьютерных игр и программ – «Steam». Любые мошеннические действия, спекуляция, монетарное влияние на других Пользователей, действия имеющие признаки финансовых операций в рамках Проекта строго запрещены. За нарушение данного требования dotaregal.com сохраняет за собой право временно отключить или аннулировать учетную запись Пользователя либо лишить Пользователя (временно или на постоянной основе) права использования Проекта.<br>
            Пользователь гарантирует свою полную осведомленность о наличии запрета на сговор между Пользователями с целью получения совместной выгоды от использования Проекта (путем раскрытия закрытых карт, разработки совместной стратегии игры, чип-дампинга или посредством других методов). За нарушение данного требования dotaregal.com сохраняет за собой право временно отключить или аннулировать учетную запись Пользователя либо лишить Пользователя (временно или на постоянной основе) права использования Проекта.<br>
            Пользователь обязуется не использовать какие-либо внешние вспомогательные игровые программы, предназначенные для предоставление Пользователю преимущества при использовании всех сервисов Проекта, в том числе ROULETTE, POKER и SLOT MACHINE. За нарушение данного требования dotaregal.com сохраняет за собой право временно отключить или аннулировать учетную запись Пользователя либо лишить Пользователя (временно или на постоянной основе) права использования Проекта.<br>
            Пользователь обязуется не использовать каким-либо способом искусственный интеллект (игроки-роботы, боты) при игре в ROULETTE, POKER и SLOT MACHINE, а также при использовании иных сервисов Проекта. За нарушение данного требования dotaregal.com сохраняет за собой право временно отключить или аннулировать учетную запись Пользователя либо лишить Пользователя (временно или на постоянной основе) права использования Проекта.<br>
            Пользователь обязуется не размещать какие-либо незаконные, непристойные, клеветнические, дискредитирующие, угрожающие или иные материалы, размещение которых нарушает какой-либо закон или в целом носит оскорбительный характер, посредством использования функции чата, в общении с другими Пользователями, прочее. За нарушение данного требования dotaregal.com сохраняет за собой право временно отключить или аннулировать учетную запись Пользователя либо лишить Пользователя (временно или на постоянной основе) права использования Проекта.<br><br>

            Безопастность. Профиль Пользователя.<br>
            Доступ к каждой учетной записи Пользователя (профиль Пользователя) осуществляется с помощью комбинации уникального Идентификатора пользователя ("Идентификатор пользователя"), уникального и секретного пароля ("Пароль"), и других дополнительных числовых методов аутентификации, которые может использовать Пользователь (далее по тексту также «Учетные данные»). Пользователь обязан выбрать свой собственный Идентификатор пользователя и Пароль в соответствии с установленными для этого правилами «Steam».<br>
            Пользователь соглашается нести исключительную ответственность за любое использование Проекта, совершаемое с применением его Учетных данных, а также не раскрывать Учетные данные другим лицам и не разрешать сторонним лицам использовать свою учетную запись.<br>
            Пользователь обязан в любое время сохранять секретность и конфиденциальность своих Учетных данных. Пользователь несет исключительную ответственность за любое несанкционированное использование Учетных данных, которое будет рассматриваться как совершенное Пользователем. Любая ответственность, возникающая в этой связи, ложится на Пользователя.<br>
            Пользователь вправе иметь только одну учетную запись Пользователя на веб-сайте http://dotaregal.com/ и обязан пользоваться Проектом исключительно посредством использования такой единственной учетной записи. Пользователям запрещено открывать несколько учетных записей http://dotaregal.com/. Если dotaregal.com станет известно о нескольких учетных записях, открытых одним Пользователем, dotaregal.com закроет все дополнительные учетные записи и имеет право конфисковать все игровые монеты и игровые предметы, имеющиеся на таких учетных записях.<br><br>

            Ответственность. Разрешение спорных ситуаций.<br>
            Если Пользователь нарушает полностью или частично какое-либо положение настоящего Соглашения, dotaregal.com оставляет за собой право на принятие необходимых по ее мнению мер, включая разрыв данного Соглашение или любого другого соглашения, заключенного с Пользователем, немедленное блокирование доступа Пользователя к Проекту или любым другим услугам, предоставляемым dotaregal.com, удаление учетной записи Пользователя на веб-сайте http://dotaregal.com/ или любых других веб-сайтах, которыми управляет dotaregal.com, конфискация всех игровых монет и игровых предметов, имеющихся у Пользователя, и/или принятие других мер юридического характера против такого Пользователя.<br>
            Пользователь полностью соглашается освободить от ответственности, обеспечить защиту и гарантировать возмещение dotaregal.com, в отношении всех притязаний, требований, обязательств, ущерба, убытков, расходов и издержек, включая судебные издержки и любые другие издержки, независимо от причин их возникновения, которые могут быть понесены dotaregal.com в результате: полного или частичного нарушения настоящего Соглашения Пользователем; нарушения Пользователем какого-либо закона или прав каких-либо третьих лиц; а также использования Проекта Пользователем или каким-либо другим лицом, получившим доступ к Проекту с помощью Учетных данных Пользователя, независимо от того, было это санкционировано Пользователем или нет.<br>
            Пользователь может подать жалобу, обратившись в службу поддержки dotaregal.com по соответствующему адресу электронной почты: <a href="mailto:support@dotaregal.com">support@dotaregal.com</a> (по вопросам сервисов ROULETTE, POKER и SLOT MACHINE) или <a href="mailto:support@dotaregal.com">support@dotaregal.com</a> (по иным спорным вопросам). Если Пользователь и dotaregal.com не достигли соглашения путем переговоров, спор передается на рассмотрения суда согласно действующему процесуальному законодательству Украины.<br>
            Заключительные положения.<br>
            dotaregal.com сохраняет за собой право обновлять или модифицировать настоящее Соглашение или любую его часть в любое время без уведомления Пользователя и такое измененное Соглашение станет обязательным к выполнению через 5 календарных дней после того, как оно будет размещено на веб-сайте http://dotaregal.com/.<br>
            Данное Соглашение и все касающиеся его вопросы регулируются и толкуются в соответствии с законодательством Украины.
            Если какое-либо положение настоящего Соглашения является или становится незаконным, недействительным или необеспеченным принудительной силой в какой-либо юрисдикции, это не повлияет на законность или возможность принудительного исполнения в этой юрисдикции какого-либо другого положения настоящего Соглашения, а также на законность или возможность принудительного исполнения в других юрисдикциях этого или какого-либо другого положения настоящего Соглашения.<br>
            Никакие положения настоящего Соглашения не создают и не предоставляют никаких прав или льгот в пользу каких-либо третьих лиц, не являющихся стороной по настоящему Соглашению.<br>
            Пользователь должен предоставлять полную и правдивую информацию, необходимую dotaregal.com для предоставлению Пользователю Проекта в соответствии с политикой конфиденциальности.<br>
            В случае какого-либо расхождения между какими-либо переведенными версиями настоящего Соглашения преимущественную силу имеет версия настоящего Соглашения на английском языке.<br>',
                    "remaining" => "секунд осталось",
                        "preload_text" => "Сайт работает в режиме демо-версии, но у Вас есть возможность зарегистрироваться и принять участие в ире прямо сейчас! Новые игры, трофеи и множество <br> впечатляющих изменений ждут Вас совсем скоро. <br>
                Оставайтесь с нами!",
                        "about" => "ABOUT",
                        "support" => "SUPPORT",
                        "tutorial" => "TUTORIAL",
                        "profile" => "PROFILE",
                        "logout" => "LOG OUT",
                        "answer" => "Support | Задайте свой вопрос поддержке",
                        "send" => "Отправить",
                        "about_1" => "Авторизируйтесь через свой Steam аккаунт",
                        "about_2" => "Перейдите в магазин",
                        "about_3" => "Меняйте предметы на монеты",
                        "about_4" => "Сделайте свою первую ставку",
                        "about_5" => "Наслаждайтесь",
                        "about_6" => "Не забывайте приглашать друзей и получите за это бонусные монеты",
                        "license_accept" => "Я принимаю в полном объеме данное Лицензионное соглашение, а также подтверждаю, что мой возраст не менее 18 лет.",
                        "roulette" => "ROULETTE",
                        "bandit" => "SLOT MACHINE",
                        "poker" => "POKER",
                        "cas" => "Click and start",
                        "audio_error" => "Ваш браузер не поддерживает аудио элемент."
                ],
                'roulette' => [
                    "title" => 'Roulette',
                    "users" => 'USERS',
                    "bet_accept" => 'Ваша ставка попала в игру!',
                    "bet_queue" => 'Ваша ставка попала в очередь!',
                    "queue_is_clear" => 'Нам не удалось найти вашу ставку в очереди!',
                    "bets_was_closed" => 'Ставки в этот раунд уже закрыты!',
                    "small_money" => 'Недостаточно баланса!',
                    "min_deposit" => 'Минимальная ставка - ',
                    "max_deposit" => 'Максимальная ставка - ',
                    "m_counts" => 'Допустимое кол-во множителей - ',
                    "dunderstand" => 'Мы не смогли понять, на какой цвет вы хотите поставить!'

                ],
                "chat" => [
                    "input" => "CHAT HERE"
                ],
                "bandit" => [
                    "title" => "Slot Machine",
                    "paytable" => "PAY TABLE",
                    "maxbetbtn" => "MAX BET",
                    "autoplay" => "AUTO<wbr>PLAY",
                    "spin" => "SPIN",
                    "balance" => "MY COINS:",
                    "bet" => "BET",
                    "line" => "LINE",
                    "win" => "WIN:",
                    "totalbet" => "TOTAL BET:",
                    "mbauth" => 'Вы должны авторизироваться!',
                    "lgameend" => 'Старая игра еще не закончилась!',
                    "cflines" => 'Не удалось найти число линий!',
                    "cfbet" => 'Не удалось найти сумму ставки!',
                    "minbet" => 'Минимальная ставка - ',
                    "maxbet" => 'Максимальная ставка - ',
                    "small_money" => 'Недостаточно баланса!',
                    "gamend" => 'Игра закончилась!',
                    "bonus1" => "SELECT A CELL AND GET A PRICE",
                    "bonus2" => "TRY YOUR LUCK",
                    "bonus3" => "FIND A COUPLE",
                    "bonus_title" => "BONUS GAME",
                    "continue" => "CONTINUE GAME",
                    "finish" => "FINISH GAME",
                    "win" => 'WIN'
                ],
                "poker" => [
                    "title" => 'Poker',
                    "place" => 'PLACE YOUR BETS',
                    "paytable" => 'PAY TABLE',
                    "rules" => 'RULES',
                    "undo" => 'UNDO',
                    "clear" => 'CLEAR',
                    "take_dec" => 'СДЕЛАЙТЕ ВЫБОР',
                    "accepted" => 'СТАВКА ПРИНЯТА',
                    "rules_text" => '
Ультимейт техасский покер (Ultimate Texas Hold’em) – простая и увлекательная игра, изобретенная в начале ХХI века Роджером Сноу из компании Shuffle Master. Соответственно права на ее распространение принадлежат этой компании. За основу в "Ультимейте" взят полюбившийся игрокам техасский покер (Texas Hold’em Poker), а точнее его адаптация для казино – Casino Texas Hold’em. Самым интересным в "Ультимейте" является то, что игрок может ставить подтверждение в любое время игры.<br><br>

Покер Ультимейт Техас (Ultimate Texas Hold’em)<br><br>

Игра ведется колодой в 52 листа. Для начала игры, игроки должны поставить ставку анте и ставку на принудительный бонус (блайнд), равный ставке анте. После этого дилер раздает в темную по две карты каждому участнику игры, включая себя. На основании своих двух карт, игроки принимают решение о продолжении игры: они могут поставить ставку бет, равную четырем анте, или сказать "чек". Сдаваться, т.е. говорить "пас" является неразумным, так как игрок все равно продолжается оставаться в игре.<br><br>

В следующем этапе игры дилер открывает три общие карты (флоп). Если игроки уже поставили до этого бет, то никаких действий до окончания игры они уже не предпринимают. Те, кто сказал ранее "чек", могут поставить ставку бет, теперь уже равную двум анте, или снова пропустить – сказать "чек".<br><br>

Далее дилер добавляет к двум картам флопа еще 2 общие карты. Игроки, сказавшие "чек", могут поставить ставку бет, равную всего одному анте, либо скинуть карты – "пас".<br><br>

Когда все игроки приняли решение относительно продолжения игры, дилер открывает свои две карты, и строит наивысшую пятикарточную комбинацию из семи карт (две свои + пять на флопе). Минимальная игра дилера – пара двоек. В случае если у игрока комбинация больше, чем у дилера, ставки анте и бет оплачиваются 1:1, в противном случае ставки анте и бет проигрывают. Если у дилера нет игры, ставка анте не оплачивается. Если комбинации игрока и дилера равноценны, ставки анте, блайнд и бет не проигрывают и не выигрывают (ничья).<br><br>
Также в начале игры можно сделать ставку на добровольный бонус (трипс), который играет независимо от игры дилера. Если комбинация менее чем "три одного типа", то ставка "трипс" проигрывает.<br>
                    ',
                    "trips" => 'TRIPS',
                    "blind" => 'BLIND',
                    "ante" => 'ANTE',
                    "bet" => 'BET',
                    'play' => 'PLAY',
                    "mycoins" => 'MY COINS:',
                    "total" => 'TOTAL RATE:',
                    "uwin" => 'ВЫ ПОБЕДИЛИ',
                    "check" => 'CHECKED',
                    "dwin" => 'ПОБЕДИЛ ДИЛЕР',
                    "dealer" => 'DEALER',
                    "player" => 'PLAYER',
                    "must_auth" => 'Вам необходимо авторизироваться!',
                    "lgameend" => 'Старая игра еще не закончена!',
                    "undsumm" => 'Вы забыли указать сумму ставки!',
                    "small_money" => 'Недостаточно баланса!',
                    "x_ante" => 'На балансе должно оставаться x1 Ante',
                    "timeend" => 'Время истекло!',
                    "gameend" => 'Игра окончена!',
                    "rflush" => 'Royal Flush',
                    "sflush" => 'Straight Flush',
                    "fok" => 'Four of Kind',
                    "fullhouse" => 'Full House',
                    "flush" => 'Flush',
                    "straight" => 'Straight',
                    "tok" => 'Three of Kind',
                    "tp" => 'Two Pairs',
                    "op" => 'One Pair',
                    "hc" => 'High Card',
                    "idcombo" => 'КОМБИНАЦИИ ОДИНАКОВЫЕ! ВЫИГРЫШ : ',
                    "ngame" => 'У ДИЛЕРА НЕТ ИГРЫ! ВЫИГРЫШ : ',
                    "win" => 'ПОЗДРАВЛЯЕМ! ВЫИГРЫШ : ',
                    "lose" => 'ВЫ ПРОИГРАЛИ!'
                ],
                "shop" => [
                    "dep_title" => 'Deposit',
                    "with_title" => 'Withdraw',
                    "must_auth" => 'Вы должны быть авторизированы!',
                    "trade_link" => 'Укажите свою трейд-ссылку в настройках!',
                    "trylater" => 'Ошибка. Попробуйте позднее!',
                    "min_dep" => 'Минимальная стоимость предмета для депозита - ',
                    "cnfitems" => 'Не удалось найти один или несколько предметов в вашем инвентаре!',
                    "cnfitems2" => 'Не удалось найти один или несколько предметов на наших ботах!',
                    "min_dep_offer" => 'Минимальная сумма депозита - ',
                    "wait_offer" => 'Ожидайте предложение, оно придет в течении 5-ти минут!',
                    "lvl_1" => 'Вам необходимо достичь ',
                    "lvl_2" => ' уровня, чтобы выводить средства!',
                    "max_with" => 'Допустимое кол-во предметов для вывода за раз - ',
                    "min_with" => 'Минимальная сумма вывода - ',
                    "small_money" => 'Недостаточно баланса!',
                    "check_offer" => 'Ваш вывод обрабатывается!',
                    //
                    "upd_trade" => 'ОБНОВИТЬ ТРЕЙД-ССЫЛКУ STEAM',
                    "upd_trade1" => "Don't know what a steam trade URL is?",
                    "upd_trade2" => 'Get your steam trade URL here',
                    "upd_trade3" => 'Please set your inventory to public!',
                    "upd_trade4" => 'You can do it here',
                    "mycoins" => 'MY COINS:',
                    "deposit" => 'DEPOSIT',
                    "withdraw" => 'WITHDRAW',
                    "check_steam" => 'ПРОВЕРИТЬ СТАТУС STEAM',
                    "search" => 'ПОИСК',
                    "by_price" => 'ПО ЦЕНЕ',
                    "by_rarity" => 'ПО РЕДКОСТИ',
                    "by_type" => 'ПО ТИПУ',
                    "by_heroes" => 'ПО ГЕРОЮ',
                    "by_quality" => 'ПО КАЧЕСТВАМ',
                    "by_price" => 'ПО ЦЕНЕ',
                    "search2" => 'ПОИСК',
                    "all" => 'All',
                    "desc" => 'Desc',
                    "asc" => 'Asc',
                    "selected" => 'SELECTED SKINS',
                    "cost" => 'COST',
                    "withdraw_btn" => 'WITHDRAW',
                    "deposit_btn" => 'DEPOSIT',
                    "artifacts" => 'ARTIFACTS',
                    "enter_trade" => 'Enter your steam trade URL',
                    "add_trade" => 'ADD'
                ],
                "profile" => [
                    "mycoins" => 'MY COINS:',
                    "deposit" => 'DEPOSIT',
                    "withdraw" => 'WITHDRAW',
                    "gamesp" => 'GAMES PLAYED:',
                    "double" => 'ROULETTE',
                    "bandit" => 'SLOT MACHINE',
                    "poker" => 'POKER',
                    "my_collection" => 'My collection',
                    "all_collection" => 'All trophies',
                    "gen_collection" => 'General trophies',
                    "lvl_collection" => 'Level trophies',
                    "r" => 'R',
                    "s" => 'S',
                    "p" => 'P',
                    "free" => 'FREE COINS',
                    "enter" => 'Enter a promo code and get free coins',
                    "btn" => 'ENTER',
                    "logout" => 'LOG OUT'
                ],
                "achievements" => [
                    'Welcome' => [
                        'desc' => 'За регистрацию',
                        'value' => 100
                    ],
                    'First blood' => [
                        'desc' => 'первая выигранная ставка',
                        'value' => 'x2 к выигрынной сумме'
                    ],
                    'Tripple boy (silver)' => [
                        'desc' => '20 выигранных раздач в покере с комбинацией сет',
                        'value' => 3000
                    ],
                    'Tripple boy (gold)' => [
                        'desc' => '100 выигранных раздач в покере с комбинацией сет',
                        'value' => 'х2 к сумме последнего выигрыша'
                    ],
                    'Cardsharper (silver)' => [
                        'desc' => 'Впервые собрать комбинация Royal Flush',
                        'value' => 5000
                    ],
                    'Cardsharper (gold)' => [
                        'desc' => '10 побед с комбинацией Royal Flush',
                        'value' => 25000
                    ],
                    'Bandit' => [
                        'desc' => 'Выиграть по всем 9 линиям сразу',
                        'value' => '10 spins'
                    ],
                    'Highway to hell' => [
                        'desc' => '10 раз подряд проиграл',
                        'value' => 1000
                    ],
                    'Lucky seven' => [
                        'desc' => '7 раз подряд выиграть',
                        'value' => 1000
                    ],
                    'Who is your daddy?' => [
                        'desc' => 'Выиграть по ставке 10.000',
                        'value' => 10000
                    ],
                    'Red devil' => [
                        'desc' => '3 раза подряд поставить и выиграть на красном',
                        'value' => 'х3 к последней выигранной ставке'
                    ],
                    'Beginner' => [
                        'desc' => 'Первые 100 побед в сумме во всех приложениях',
                        'value' => 1000
                    ],
                    'Playa' => [
                        'desc' => '1000 побед в сумме во всех приложениях',
                        'value' => 10000
                    ],
                    'Investor' => [
                        'desc' => 'Внести на сайт предметов на общую сумму 100 000 коинов',
                        'value' => 10000
                    ],
                    'Millionaire' => [
                        'desc' => 'Ставка на миллион',
                        'value' => 100000
                    ],
                    'Fortune (silver)' => [
                        'desc' => 'Первая бонусная игра',
                        'value' => '1 spin'
                    ],
                    'Nine Line' => [
                        'desc' => 'Первый раз выиграть на 9 линиях в бандите',
                        'value' => 900
                    ],
                    'Headstrong' => [
                        'desc' => 'Делать ставки на протяжении 10 дней',
                        'value' => 1000
                    ],
                    'Lol' => [
                        'desc' => 'Проиграть 100000+ за раз',
                        'value' => 50000
                    ],
                    'Spam' => [
                        'desc' => 'Первое сообщение в чате',
                        'value' => 100
                    ],
                    'Desperate' => [
                        'desc' => 'Сделать депозит с Арканой',
                        'value' => 1000
                    ],
                    'Rebel' => [
                        'desc' => 'Попасть в бан',
                        'value' => 0
                    ],
                    'Start-up' => [
                        'desc' => 'Первый депозит',
                        'value' => 100
                    ],
                    'School diary' => [
                        'desc' => 'Первый раз в покере собрать каре из двоек и выиграть',
                        'value' => 2000
                    ],
                    'Fortune (gold)' => [
                        'desc' => 'Выиграть 10 бонусных игр',
                        'value' => '5 spins'
                    ],
                    'Roofless' => [
                        'desc' => 'Проиграть весь баланс',
                        'value' => 100
                    ],
                    'Rookie' => [
                        'desc' => 'Достичь 5-го уровня',
                        'value' => 500
                    ],
                    'Legend' => [
                        'desc' => 'Достичь 25-го уровня',
                        'value' => 25000
                    ],
                    'Greedy' => [
                        'desc' => 'Активировать 5 разных промокодов',
                        'value' => 100
                    ],
                    'Straight on my street' => [
                        'desc' => 'Собратить первый раз комбинацию Straight',
                        'value' => 1000
                    ],
                    'Always in the game' => [
                        'desc' => 'Cыграть 15 подряд раздач в покере не скидывая карты',
                        'value' => 1500
                    ],
                    'Psycho' => [
                        'desc' => 'Сыграть 500 раз за день',
                        'value' => 5000
                    ],
                    'Dota Regal' => [
                        'desc' => 'Достичь 30-го уровня',
                        'value' => 100000
                    ],
                    'Regal Bank' => [
                        'desc' => 'Внести вещей на сумму 1.000.000 коинов',
                        'value' => 100000
                    ],
                    'Collector' => [
                        'desc' => 'Собрать 10 призов',
                        'value' => 1000
                    ],
                    'Dead dream' => [
                        'desc' => 'Собрать все призы',
                        'value' => 100000
                    ],
                    'Four kingdoms' => [
                        'desc' => 'собрать каре из королей первый раз',
                        'value' => 4000
                    ],
                    'Elite' => [
                        'desc' => 'Достичь 15-го уровня',
                        'value' => 5000
                    ],
                    'Royal' => [
                        'desc' => 'Достичь 20-го уровня',
                        'value' => 10000
                    ],
                    'Keep her steady' => [
                        'desc' => 'Достичь 10-го уровня',
                        'value' => 1000
                    ],
                    'Shopper' => [
                        'desc' => 'Сделать первый вывод',
                        'value' => 500
                    ],
                    'Bad achievement' => [
                        'desc' => 'Проиграть 1000 раз',
                        'value' => 1000
                    ],
                    '3x5' => [
                        'desc' => 'Выиграть комбинацию из 5 иконок по 3 линиям сразу',
                        'value' => 3000
                    ],
                    '666' => [
                        'desc' => 'Сыграть на 6 линиях 666 раз',
                        'value' => 6666
                    ],
                    'Guess my pair' => [
                        'desc' => 'Выиграть раздачу в покере с парой троек пять раз',
                        'value' => 3000
                    ],
                    'Like a cat' => [
                        'desc' => 'Проиграть на 9 линия 9 раз в бандите',
                        'value' => 1800
                    ],
                    'Autopilot' => [
                        'desc' => '100 игр на автоплее в бандите',
                        'value' => 1000
                    ],
                    'Practice' => [
                        'desc' => 'Cделать ставку в каждом из приложений',
                        'value' => 300
                    ],
                    'Freebie' => [
                        'desc' => 'Собрать 100 фриспинов в бандите',
                        'value' => '10 spins'
                    ],
                    'Traffic light' => [
                        'desc' => 'Выиграть 125 раз на каждом из цветов ,кроме синего',
                        'value' => 5000
                    ],
                    'Support' => [
                        'desc' => 'Напиши отзыв в тех поддержку',
                        'value' => 100
                    ],
                    'Are you okay?' => [
                        'desc' => 'Достичь 50-го уровня',
                        'value' => 250000
                    ],
                    'Junk' => [
                        'desc' => 'Вывести 100 вещей не дороже 600 коинов',
                        'value' => 6000
                    ],
                    'so, what is next?' => [
                        'desc' => 'Достичь 99-го уровня',
                        'value' => 1000000
                    ],
                    'Baker’s dozen' => [
                        'desc' => '13 раз выиграть на красном',
                        'value' => 1300
                    ],
                    'Never give up' => [
                        'desc' => 'Выиграть раздачу на старшей карте',
                        'value' => 1000
                    ],
                    'Squad' => [
                        'desc' => 'Пригласить 10 новых пользователей по рефератной системе',
                        'value' => 1000
                    ],
                    'Thug life' => [
                        'desc' => 'Cыграть в бандите на макс бет 10 раз',
                        'value' => 1000
                    ],
                    'Flash' => [
                        'desc' => 'Поднять 10 уровней за один день',
                        'value' => 2000
                    ],
                    'All in' => [
                        'desc' => 'Cделать макс бет',
                        'value' => 500
                    ]
                ],
                "tutorial" => '
Вас приветствует портал Dota Regal.<br>
        Мы предлагаем вам испытать удачу и погрузиться в виртуальный мир Dota 2.<br>
        Тут вы не будете принимать участия в фантастических сражениях между добром и злом , Но нам есть что предложить вам в замен! Если доспехи уже не вызывают восторга у союзников , а враги больше не трепещат при виде вашего ,когда-то , смертоносного оружия. Если у вашего курьера стало не хватать выносливости регулярно доставлять вам товары из торговой лавки. Или вы просто хотите приобрести необычный облик в виде Арканы , но не хотите тратить деньги. Тогда вы попали прямо по адресу! Вносите депозит в виде артефактов в нашем Regal Bank , получая в замен игровую валюту. Делайте ставки в приложениях и выводите много разных вещей в разделе withdraw!Отдавай, играй и забирай больше на сайте .
                '
            ],
            // ENGLISH
            "en" => [
                "achievement_unlock" => 'Unlocked achievement : ',
                "lobby" => [
                    "license_title" => 'Terms and conditions',
                    "license" => 'This End User License Agreement, as amended on 26.07.2017 (hereinafter referred to as the
&quot;Agreement&quot;), must be fully read by any person (hereinafter also referred to as the &quot;User&quot;) before
using the services, resources and tools of the website http://dotaregal.com/, containing a collection
of data, electronic (digital) information, as well as other copyright objects (hereinafter collectively
referred to as the «Project&quot;).
The Agreement establishes general conditions for the use of the Project, User guarantees,
confidentiality regime, as well as exclusive rights of the Project owner (hereinafter referred to as
&quot;dotaregal.com&quot;).
Accepting this Agreement the User (accepting it by clicking the &quot;Accept&quot; button) recognizes the
exclusive right of dotaregal.com to the Project (both the author and the owner), in addition User
understands the meaning and controls his actions, understands the meaning of each clause of this
Agreement, their legal significance , the irreversibility of the consequences of violation of the
requirements of the Agreement, as well as the responsibility established for it, confirms the
following guarantees and takes all risks of using the Project on its own.
General Provisions of License Granted
In accordance with the terms of this Agreement, dotaregal.com grants to the User a non-exclusive,
personal, non-transferable right to use the Project (services, resources and tools of the website
http://dotaregal.com/) for the purpose of playing in ROULETTE, POKER or SLOT MACHINE. At
the same time, the User is aware that ROULETTE, POKE Agreement establishes general terms of
use of the Project, User guarantees, privacy mode, and exclusive rights of the Project owner
(hereinafter referred to as «dotaregal.com&quot;).
R and SLOT MACHINE are integral parts of the website http://dotaregal.com/, are part of the
Project, belong to dotaregal.com and are protected by copyright.
The project license is granted only to the adult user for private individual use. At the same time, the
Project is not intended for use by persons who have not reached the age of majority established by
law in the relevant jurisdiction of the User&#39;s country. dotaregal.com is not in a position to establish
the age of majority of a person in each jurisdiction, and the clarification of this matter is the User&#39;s
responsibility.
dotaregal.com reserves the right at any time to require the User to prove the age of majority to
ensure that minors do not use the Project.
dotaregal.com reserves the right to temporarily disable or cancel the User&#39;s account or deprive the
User (temporarily or permanently) of the right to use the Project if dotaregal.com is not provided
with the proof of majority or if dotaregal.com suspects that the User has not reached majority.
The project is not intended for use by persons connecting to http://dotaregal.com/ from jurisdictions
in which such connection is illegal. dotaregal.com is unable to establish the legality of the Project in
each jurisdiction, and the clarification of this matter is the User&#39;s responsibility.
dotaregal.com reserves the right to temporarily disable or cancel the account of the User or deprive
the User (temporarily or permanently) of the right to use the Project if dotaregal.com does not have
sufficient evidence to support the legitimacy of the connection to http://dotaregal.com/ from the
jurisdiction of the User.
dotaregal.com is the sole owner of all rights to the Project, including the source code, the structure
and organization of the Project, the services - ROULETTE, POKER and SLOT MACHINE, the
collection of data, electronic (digital) information, including copyrights, classified technologies,
intellectual property and other rights. The action of this item also applies to any modifications to the
Project, Project services, carried out by dotaregal.com in the future.
The user does not have the right:
- to copy, distribute, publish, decompile, disassemble, modify or transform the Project (any part
thereof), or make any attempt to access the source code for creating derivative programs
(websites, web pages) based on the source code of the Project or otherwise;
- to sell, assign, sublicense, transfer, distribute or provide the Project (any part thereof) for
temporary use;
- to provide access to the Project to any third parties through a computer network or otherwise;
- to export the Project to any country (both physically and electronically);

to use the Project in any way prohibited by applicable laws and regulations (under current
legislation and regulatory documents should be understood as Ukrainian legislation, as well as
international agreements ratified by Ukraine).
Limitations set forth in 1.8. The agreements are not exhaustive and relate to the Unauthorized Use
of the Project.
dotaregal.com reserves all the alleged and other rights that are not expressly transferred to the
User by this Agreement.
The User agrees to be liable for any damage, costs and expenses incurred as a result of or in
connection with any unauthorized use of the Project by him.
The User is obliged to immediately notify dotaregal.com about every case of Unauthorized Use of
the Project by any person he has become aware of and to provide dotaregal.com support in any
investigation that will be initiated by dotaregal.com in view of receiving the above information.
The User, when using the Project, undertakes not to take any actions that could damage the image
and reputation of dotaregal.com.
The User guarantees that the use of any names, images, other information, when using the Project
(for example, user name, avatar, contacts), does not violate any rights to intellectual property,
privacy rights and any other rights of any third party.
The User provides dotaregal.com with an international, irrevocable, transferable, royalty-free,
sublicensing right to use these names, images, other information about the User for any purposes
related to the Project, provided that the terms of the privacy policy set forth in this Agreement.
User&#39;s Warranties. The limitations of dotaregal.com. Prior to the commencement, as well as
throughout the term of use of the Project for personal use under the terms of this Agreement, the
User gives his consent, undertakes and guarantees the following:
The User realizes in full that when using the Project, in the part of the game in ROULETTE,
POKER and SLOT MACHINE, there is a risk of losing the game coins used in the Project, as well
as the game items used in the circulation of the digital distribution service of computer games and
programs - &quot;Steam &quot;. According to the facts, dotaregal.com does not bear any responsibility to the
User for any losses. The risk of losing coins and gaming items is fully acceptable to the User.
The User uses the Project at will.
The User uses the proven Internet services of trusted suppliers (providers) when accessing Project
resources. At the same time, the telecommunication networks and Internet services required for
the User to access the Project are completely beyond the control of dotaregal.com, so
dotaregal.com is not responsible for any disconnections, low speed, bandwidth restrictions or other
problems.
The User has reached the age of majority in accordance with the legal age of majority in the
relevant jurisdiction of the User&#39;s country.
The User gives his consent in accordance with the legislation and to access his use of all Project
resources to provide his personal data to dotaregal.com.
The User allows dotaregal.com (and third parties acting on behalf of dotaregal.com) to access and
/ or use the User&#39;s location and / or other necessary data to provide the User with the resources
and functionality of the Project, as well as information that can be indirectly obtained about device /
computer of the User. At the same time the User is aware that he is prohibited from using the
Project if he does not want to give such permission.
The User accepting this Agreement agrees that dotaregal.com disclaims all warranties, express or
implied in connection with the use of the User by the Project.
The User agrees that the Project is provided to him according to the principle &quot;AS IS&quot;, and
dotaregal.com does not provide any warranties or assurances to the User regarding the quality of
the Project, its conformity to the purpose, completeness or accuracy, and also the expectations of
the User. At the same time, regardless of dotaregal.com&#39;s efforts to provide the User with the
Project meeting the highest standards of quality, reliability and security, dotaregal.com makes no
guarantees that the Project will work continuously, timely and without errors, and that such defects
will or that the Project will not contain viruses or errors.
The User agrees that dotaregal.com reserves the right to suspend, terminate, modify, add, modify
or delete the Project.

The User undertakes to use the Project only for individual purposes, solely for personal
entertainment. Under no circumstances shall the User be entitled to use his profile on the Project
for any purpose other than that established in this Agreement. For violation of this requirement,
dotaregal.com reserves the right to temporarily disable or cancel the User&#39;s account or deprive the
User (temporarily or permanently) of the right to use the Project.
The User undertakes not to perform any manipulations with game coins, as well as game items of
the service of digital distribution of computer games and programs - &quot;Steam&quot;. Any fraudulent
actions, speculation, monetary influence on other Users, actions having signs of financial
operations within the framework of the Project are strictly prohibited. For violation of this
requirement, dotaregal.com reserves the right to temporarily disable or cancel the User&#39;s account
or deprive the User (temporarily or permanently) of the right to use the Project.
The user guarantees his full knowledge of the existence of a ban on collusion between users in
order to obtain a joint benefit from the use of the Project (by disclosing closed cards, developing a
joint game strategy, chip dumping or other methods). For violation of this requirement,
dotaregal.com reserves the right to temporarily disable or cancel the User&#39;s account or deprive the
User (temporarily or permanently) of the right to use the Project.
The User undertakes not to use any external auxiliary game programs intended to provide the User
with an advantage when using all services of the Project, including ROULETTE, POKER and
SLOT MACHINE. For violation of this requirement, dotaregal.com reserves the right to temporarily
disable or cancel the User&#39;s account or deprive the User (temporarily or permanently) of the right to
use the Project.
The User undertakes not to use artificial intelligence (robots, bots) in any way when playing
ROULETTE, POKER and SLOT MACHINE, or when using other services of the Project. For
violation of this requirement, dotaregal.com reserves the right to temporarily disable or cancel the
User&#39;s account or deprive the User (temporarily or permanently) of the right to use the Project.
The User undertakes not to post any illegal, obscene, defamatory, threatening or other materials,
the placement of which violates any law or is generally offensive, by using the chat function, in
communication with other Users, etc. For violation of this requirement, dotaregal.com reserves the
right to temporarily disable or cancel the User&#39;s account or deprive the User (temporarily or
permanently) of the right to use the Project.
Security. User Profile.
Access to each account of the User (User Profile) is carried out using a combination of a unique
User ID (&quot;User ID&quot;), a unique and secret password (&quot;Password&quot;), and other additional numeric
authentication methods that the User can use (hereinafter also &quot;Credentials&quot;). The user must
choose his own User ID and Password in accordance with the established rules of &quot;Steam&quot;.
The User agrees to bear exclusive responsibility for any use of the Project performed with the use
of his Credentials, and not to disclose Credentials to others and not allow third parties to use their
account.
The User is obliged to keep the privacy and confidentiality of his / her Credentials at any time. The
User is solely responsible for any unauthorized use of the Credentials, which will be treated as
committed by the User. Any liability arising in this connection shall be borne by the User.
The User has the right to have only one User account on the website http://dotaregal.com/ and is
obliged to use the Project solely through the use of such a single account. Users are not allowed to
open multiple accounts http://dotaregal.com/. If dotaregal.com becomes aware of multiple accounts
opened by one User, dotaregal.com will close all additional accounts and has the right to
confiscate all game coins and game items available on such accounts.
Responsibility. Settlement of disputable situations.
If the User violates in whole or in part any provision of this Agreement, dotaregal.com reserves the
right to take the necessary measures in its opinion, including the termination of this Agreement or
any other agreement concluded with the User, immediate blocking of the User&#39;s access to the
Project or any other the services provided by dotaregal.com, the deletion of the User account on
the website http://dotaregal.com/ or any other websites operated by dotaregal.com, the
confiscation of all gaming coins and game items , available to the User, and / or taking other legal
measures against such User.

The User fully agrees to indemnify, defend and guarantee the reimbursement of dotaregal.com, in
respect of all claims, demands, liabilities, damages, losses, costs and expenses, including legal
fees and any other costs, regardless of the cause thereof, which may be dotaregal.com as a result
of: full or partial violation of this Agreement by the User; violation by the User of any law or the
rights of any third parties; as well as the use of the Project by the User or any other person who
has accessed the Project using the User&#39;s Credentials, regardless of whether this was authorized
by the User or not.
The user can file a complaint by contacting dotaregal.com support at the appropriate e-mail
address: support@dotaregal.com (for services of ROULETTE, POKER and SLOT MACHINE) or
support@dotaregal.com (for other controversial issues). If the User and dotaregal.com did not
reach an agreement by negotiation, the dispute shall be referred to the court for consideration in
accordance with the current procedural legislation of Ukraine.
Final provisions.
dotaregal.com reserves the right to update or modify this Agreement or any part thereof at any time
without notice to the User and such an amended Agreement will become binding after 5 calendar
days after it is posted on the website http: // dotaregal .com /.
This Agreement and all matters relating to it are regulated and interpreted in accordance with the
legislation of Ukraine. If any provision of this Agreement is or becomes illegal, invalid or unsecured
by a coercive power in any jurisdiction, this will not affect the legality or enforceability in this
jurisdiction of any other provision of this Agreement, as well as the legality or possibility of
compulsory Execution in other jurisdictions of this or any other provision of this Agreement.
No provisions of this Agreement create or confer any rights or benefits in favor of any third party
who is not a party to this Agreement.
The User must provide complete and truthful information required by dotaregal.com to provide the
User with the Project in accordance with the privacy policy.
In the event of any discrepancy between any translated versions of this Agreement, the English
version of this Agreement shall prevail.<br>',
                    "remaining" => "sec  remaining",
                        "preload_text" => "The site is running in demo-version, but you still can sign-in and play right now! New games, trophies and a lot of great <br>changes are coming soon. <br>
                Stay tuned!",
                        "about" => "ABOUT",
                        "support" => "SUPPORT",
                        "tutorial" => "TUTORIAL",
                        "profile" => "PROFILE",
                        "logout" => "LOG OUT",
                        "answer" => "Support | Ask your question",
                        "send" => "Send",
                        "about_1" => "Sign-in with your Steam account",
                        "about_2" => "go to our shop",
                        "about_3" => "exchange items to coins",
                        "about_4" => "make your first bet",
                        "about_5" => "have fun",
                        "about_6" => "Don't forget to invite your friends with a help of unique promo-code and get free coins",
                        "license_accept" => "I accept in full the scope of this License Agreement, and also confirm that my age is not less than 18 years.",
                        "roulette" => "ROULETTE",
                        "bandit" => "SLOT MACHINE",
                        "poker" => "POKER",
                        "cas" => "Click and start",
                        "audio_error" => "Your browser does not support the audio element."
                ],
                'roulette' => [
                    "title" => 'Roulette',
                    "users" => 'USERS',
                    "bet_accept" => 'Bet accepted!',
                    "bet_queue" => 'Your bet is in the queue!',
                    "queue_is_clear" => 'We could not find your bet in the queue!',
                    "bets_was_closed" => 'Whait till the next round!',
                    "small_money" => 'Not enough coins!',
                    "min_deposit" => 'Min bet - ',
                    "max_deposit" => 'Max bet - ',
                    "m_counts" => 'Number of multipliers - ',
                    "dunderstand" => 'We did not understand which color you choosed!'

                ],
                "chat" => [
                    "input" => "CHAT HERE"
                ],
                "bandit" => [
                    "title" => "Slot Machine",
                    "paytable" => "PAY TABLE",
                    "maxbetbtn" => "MAX BET",
                    "autoplay" => "AUTO<wbr>PLAY",
                    "spin" => "SPIN",
                    "balance" => "MY COINS:",
                    "bet" => "BET",
                    "line" => "LINE",
                    "win" => "WIN:",
                    "totalbet" => "TOTAL BET:",
                    "mbauth" => 'You must be authorized!',
                    "lgameend" => 'The previous game is running',
                    "cflines" => 'Could not find number of lines!',
                    "cfbet" => 'Could not find amount of bet!',
                    "minbet" => 'Min bet - ',
                    "maxbet" => 'Max bet - ',
                    "small_money" => 'Not enough coins!',
                    "gamend" => 'Game ended!',
                    "bonus1" => "SELECT A CELL AND GET A PRICE",
                    "bonus2" => "TRY YOUR LUCK",
                    "bonus3" => "FIND A COUPLE",
                    "bonus_title" => "BONUS GAME",
                    "continue" => "CONTINUE GAME",
                    "finish" => "FINISH GAME",
                    "win" => 'WIN'
                ],
                "poker" => [
                    "title" => 'Poker',
                    "place" => 'PLACE YOUR BETS',
                    "paytable" => 'PAY TABLE',
                    "rules" => 'RULES',
                    "undo" => 'UNDO',
                    "clear" => 'CLEAR',
                    "take_dec" => 'TAKE YOUR DECISION',
                    "accepted" => 'BIDS ACCEPTED',
                    "rules_text" => '
Ultimate Texas Hold ‘em was developed by Roger Snow of SHFL Entertainment (formerly known as Shuffle Master). It is one of the newest variations of the poker game and is currently widely popular among US casinos. It is one of the most in-demand niche table games in casinos in Las Vegas and many other states. Ultimate Texas Hold‘em (also known as Ultimate Texas holdem) is a reinvented version of the classic poker game of the same name. In this variation, the player does not compete against other players. Instead, they play only against the dealer. At any point during the course of the hand, the player is free to make one raise. In this poker-based game, the earlier the raise is made, the higher its value is.<br><br>

Ultimate Texas Hold’em <br><br>

Like the common poker game formats, Ultimate Texas Hold ‘em is played with a single, regular 52-card deck. Towards the end of the game, the dealer and the players left use any combination from their own two cards and the five community cards in order to come up with the best possible hand for themselves. The dealer will only be able to open if they possess at least a paired board. The play, ante, and blind bets are graded, depending on who wins, and whether the dealer will open.<br><br>

The player and the dealer will both get two cards. The former will then be allowed to look at their own cards and decide if they wish to check or raise four times the ante. Another option available to the player is raising three times. If the player decides to raise at any point during the hand, the action will end from their end.<br><br>

After deciding to raise, the player will be shown three cards which are referred to as the “flop”. The other players who did not raise before the flop will be given the choice to raise twice the ante. Another option available for the player would be checking.<br><br>

After the table has resolved the post-flop betting, the last two cards will be revealed. By this time, the players will be required to either match their ante or fold. After this, the dealer will reveal his two cards and grade the hand. In order for the dealer to qualify, he must possess at least a paired board. Winning play and ante bets are rewarded 1 to 1. On the other hand, the payout for trips bets depends on the value of the player’s hand – regardless of the value of the hand possessed by the dealer.

 
                    ',
                    "trips" => 'TRIPS',
                    "blind" => 'BLIND',
                    "ante" => 'ANTE',
                    "bet" => 'BET',
                    'play' => 'PLAY',
                    "mycoins" => 'MY COINS:',
                    "total" => 'TOTAL RATE:',
                    "uwin" => 'YOU WIN',
                    "check" => 'YOU CHECKED',
                    "dwin" => 'DEALER WIN',
                    "dealer" => 'DEALER',
                    "player" => 'PLAYER',
                    "must_auth" => 'You must be authorized!',
                    "lgameend" => 'Previous game is running!',
                    "undsumm" => 'You forgot to set amount of bet!',
                    "small_money" => 'Not enough coins!',
                    "x_ante" => 'You need to have x1 Ante on balance',
                    "timeend" => 'Time is up!',
                    "gameend" => 'Game over!',
                    "rflush" => 'Royal Flush',
                    "sflush" => 'Straight Flush',
                    "fok" => 'Four of Kind',
                    "fullhouse" => 'Full House',
                    "flush" => 'Flush',
                    "straight" => 'Straight',
                    "tok" => 'Three of Kind',
                    "tp" => 'Two Pairs',
                    "op" => 'One Pair',
                    "hc" => 'High Card',
                    "idcombo" => 'SAME COMBINATIONS! WIN : ',
                    "ngame" => 'DEALER GOT NO GAME! WIN : ',
                    "win" => 'CONGRATULATIONS! WIN : ',
                    "lose" => 'YOU LOSE!'
                ],
                "shop" => [
                    "dep_title" => 'Deposit',
                    "with_title" => 'Withdraw',
                    "must_auth" => 'You must be authorized!',
                    "trade_link" => 'Set up your trade URL!',
                    "trylater" => 'Error. Try later!',
                    "min_dep" => 'Min amount of deposit - ',
                    "cnfitems" => 'Could not find items!',
                    "cnfitems2" => 'Could not find items on bots!',
                    "min_dep_offer" => 'Min amount of deposit - ',
                    "wait_offer" => 'Wait for your trade. It will apear soon!',
                    "lvl_1" => 'You need to reach ',
                    "lvl_2" => ' lvl to make withdraw!',
                    "max_with" => 'Accepted amount of items for one-time withdraw - ',
                    "min_with" => 'Min withdraw amount - ',
                    "small_money" => 'Not enough coins!',
                    "check_offer" => 'Your trade is processing!',
                    //
                    "upd_trade" => 'UPDATE STEAM TRADE URL',
                    "upd_trade1" => "Don't know what a steam trade URL is?",
                    "upd_trade2" => 'Get your steam trade URL here',
                    "upd_trade3" => 'Please set your inventory to public!',
                    "upd_trade4" => 'You can do it here',
                    "mycoins" => 'MY COINS:',
                    "deposit" => 'DEPOSIT',
                    "withdraw" => 'WITHDRAW',
                    "check_steam" => 'CHECK STEAM STATUS',
                    "search" => 'SEARCH',
                    "by_price" => 'FILTER BY PRICE',
                    "by_rarity" => 'BY RARITY',
                    "by_type" => 'BY TYPE',
                    "by_heroes" => 'BY HEROES',
                    "by_quality" => 'BY QUALITY',
                    "by_price" => 'BY PRICE',
                    "search2" => 'SEARCH',
                    "all" => 'All',
                    "desc" => 'Desc',
                    "asc" => 'Asc',
                    "selected" => 'SELECTED SKINS',
                    "cost" => 'COST',
                    "withdraw_btn" => 'WITHDRAW',
                    "deposit_btn" => 'DEPOSIT',
                    "artifacts" => 'ARTIFACTS',
                    "enter_trade" => 'Enter your steam trade URL',
                    "add_trade" => 'ADD'
                ],
                "profile" => [
                    "mycoins" => 'MY COINS:',
                    "deposit" => 'DEPOSIT',
                    "withdraw" => 'WITHDRAW',
                    "gamesp" => 'GAMES PLAYED:',
                    "double" => 'ROULETTE',
                    "bandit" => 'SLOT MACHINE',
                    "poker" => 'POKER',
                    "my_collection" => 'My collection',
                    "all_collection" => 'All trophies',
                    "gen_collection" => 'General trophies',
                    "lvl_collection" => 'Level trophies',
                    "r" => 'R',
                    "s" => 'S',
                    "p" => 'P',
                    "free" => 'FREE COINS',
                    "enter" => 'Enter a promo code and get free coins',
                    "btn" => 'ENTER',
                    "logout" => 'LOG OUT'
                ],
                "achievements" => [
                    'Welcome' => [
                        'desc' => 'for registration',
                        'value' => 100
                    ],
                    'First blood' => [
                        'desc' => 'first won bet',
                        'value' => 'x2 to the winning amount'
                    ],
                    'Tripple boy (silver)' => [
                        'desc' => '20 poker hands won in poker with a set combination',
                        'value' => 3000
                    ],
                    'Tripple boy (gold)' => [
                        'desc' => '100 poker hands won in poker with a combination of sets',
                        'value' => 'x3 to the winning amount'
                    ],
                    'Cardsharper (silver)' => [
                        'desc' => 'if the user has drawn his first royal flush',
                        'value' => 5000
                    ],
                    'Cardsharper (gold)' => [
                        'desc' => '-10 times won with a combination of royal flush',
                        'value' => 25000
                    ],
                    'Bandit' => [
                        'desc' => 'first time won on 9 lines',
                        'value' => '10 spins'
                    ],
                    'Highway to hell' => [
                        'desc' => '10 times lost',
                        'value' => 1000
                    ],
                    'Lucky seven' => [
                        'desc' => '7 wins in a row',
                        'value' => 1000
                    ],
                    'Who is your daddy?' => [
                        'desc' => 'put 10,000 and win',
                        'value' => 10000
                    ],
                    'Red devil' => [
                        'desc' => '3 times in a row to put and win on red',
                        'value' => 'x3 to the last won the bet'
                    ],
                    'Beginner' => [
                        'desc' => 'the first 100 wins in the sum in all applications',
                        'value' => 1000
                    ],
                    'Playa' => [
                        'desc' => '1000 wins in total in all applications',
                        'value' => 10000
                    ],
                    'Investor' => [
                        'desc' => 'to add to the site items for a total of 100,000 coins',
                        'value' => 10000
                    ],
                    'Millionaire' => [
                        'desc' => 'the bet per million',
                        'value' => 100000
                    ],
                    'Fortune (silver)' => [
                        'desc' => 'the first bonus game',
                        'value' => '1 spin'
                    ],
                    'Nine Line' => [
                        'desc' => 'the first time to win on 9 lines in the bandit',
                        'value' => 900
                    ],
                    'Headstrong' => [
                        'desc' => '10 consecutive days making bets',
                        'value' => 1000
                    ],
                    'Lol' => [
                        'desc' => 'lose 100,000+ at one time',
                        'value' => 50000
                    ],
                    'Spam' => [
                        'desc' => 'the first message in the chat',
                        'value' => 100
                    ],
                    'Desperate' => [
                        'desc' => 'to assign an Arcana iteam',
                        'value' => 1000
                    ],
                    'Rebel' => [
                        'desc' => 'get into the ban',
                        'value' => 0
                    ],
                    'Start-up' => [
                        'desc' => 'the first deposit',
                        'value' => 100
                    ],
                    'School diary' => [
                        'desc' => 'the first time in poker to make quads of deuces and win',
                        'value' => 2000
                    ],
                    'Fortune (gold)' => [
                        'desc' => 'win 10 bonus games',
                        'value' => '5 spins'
                    ],
                    'Roofless' => [
                        'desc' => 'to lose the entire balance',
                        'value' => 100
                    ],
                    'Rookie' => [
                        'desc' => 'reaching level 5',
                        'value' => 500
                    ],
                    'Legend' => [
                        'desc' => 'reaching level 25',
                        'value' => 25000
                    ],
                    'Greedy' => [
                        'desc' => 'enter 5 promotional codes',
                        'value' => 100
                    ],
                    'Straight on my street' => [
                        'desc' => 'gather the first straight',
                        'value' => 1000
                    ],
                    'Always in the game' => [
                        'desc' => 'play 15 consecutive hands in poker without folding cards',
                        'value' => 1500
                    ],
                    'Psycho' => [
                        'desc' => 'play roulette 500 times a day',
                        'value' => 5000
                    ],
                    'Dota Regal' => [
                        'desc' => 'achievement of level 30',
                        'value' => 100000
                    ],
                    'Regal Bank' => [
                        'desc' => 'to lead things in a million',
                        'value' => 100000
                    ],
                    'Collector' => [
                        'desc' => 'collect 10 prizes',
                        'value' => 1000
                    ],
                    'Dead dream' => [
                        'desc' => 'to collect all the prizes',
                        'value' => 100000
                    ],
                    'Four kingdoms' => [
                        'desc' => 'pick quads from kings for the first time',
                        'value' => 4000
                    ],
                    'Elite' => [
                        'desc' => 'reaching level 15',
                        'value' => 5000
                    ],
                    'Royal' => [
                        'desc' => 'reaching level 20',
                        'value' => 10000
                    ],
                    'Keep her steady' => [
                        'desc' => 'reaching level 10',
                        'value' => 1000
                    ],
                    'Shopper' => [
                        'desc' => 'first withdrawal',
                        'value' => 500
                    ],
                    'Bad achievement' => [
                        'desc' => 'lose 1000 times in roulette',
                        'value' => 1000
                    ],
                    '3x5' => [
                        'desc' => 'win on 3 lines 5 icons in a row',
                        'value' => 3000
                    ],
                    '666' => [
                        'desc' => 'play on 6 lines 666 times',
                        'value' => 6666
                    ],
                    'Guess my pair' => [
                        'desc' => 'win a hand in poker with a pair of triplets five times',
                        'value' => 3000
                    ],
                    'Like a cat' => [
                        'desc' => 'lose 9 lines 9 times in the gangster',
                        'value' => 1800
                    ],
                    'Autopilot' => [
                        'desc' => '100 games on the autoplay',
                        'value' => 1000
                    ],
                    'Practice' => [
                        'desc' => 'make a bet in each of the applications',
                        'value' => 300
                    ],
                    'Freebie' => [
                        'desc' => 'gather 100 free spins in a bandit',
                        'value' => '10 spins'
                    ],
                    'Traffic light' => [
                        'desc' => 'win 125 times on each of the colors, except blue, in a roulette',
                        'value' => 5000
                    ],
                    'Support' => [
                        'desc' => 'write a review for tech support',
                        'value' => 100
                    ],
                    'Are you okay?' => [
                        'desc' => 'reaching level 50',
                        'value' => 250000
                    ],
                    'Junk' => [
                        'desc' => '`withdrawal 100 items not more than for 600 coins',
                        'value' => 6000
                    ],
                    'so, what is next?' => [
                        'desc' => 'reaching level 99',
                        'value' => 1000000
                    ],
                    'Baker’s dozen' => [
                        'desc' => '13 times to win on the red',
                        'value' => 1300
                    ],
                    'Never give up' => [
                        'desc' => 'win a hand on the highest card',
                        'value' => 1000
                    ],
                    'Squad' => [
                        'desc' => 'invite 10 new users by referral system',
                        'value' => 1000
                    ],
                    'Thug life' => [
                        'desc' => 'play bandit at max bet 10 times',
                        'value' => 1000
                    ],
                    'Flash' => [
                        'desc' => 'raise 10 levels in one day',
                        'value' => 2000
                    ],
                    'All in' => [
                        'desc' => 'make max bet in roulette',
                        'value' => 500
                    ]
                ],
                "tutorial" => '
Welcome to the portal Dota Regal.<br>
        We suggest you to try your luck and dive into the virtual world of Dota 2.<br>
Here you will not take part in the fantastic battles between good and evil, but we have something to offer you in return! If the armor no longer causes rapture from the allies, and the enemies no longer tremble at the sight of your, once, deadly weapon. If your courier began to lack the stamina regularly to deliver goods to you from the shop. Or you just want to get an unusual look in the form of an Arcana, but do not want to spend money. Then you hit the right place! Make a deposit in the form of artifacts in our Regal Bank, receiving in exchange the game currency. Make bets in the applications and withdraw a lot of different items in the withdraw section! Give, play and take more on the site.
                '
            ]
        ];

        return $list[$lang];
    }

    public static function setTitle($title)
    {
        $config = Settings::first();
        view()->share('title', $title);
        view()->share('config', $config);
    }

    public static function curlExec($url)
    {
        $proxy = DB::table('proxy')->where('used', 0)->orderBy('id', 'desc')->first();
        if(is_null($proxy)) {
            DB::table('proxy')->update(['used' => 0]);
            return Controller::curlExec($url);
        }

        DB::table('proxy')->where('id', $proxy->id)->update(['used' => 1]);

        $curl = curl_init();
        curl_setopt($curl, CURLOPT_URL, $url);
        /* proxy test */


        curl_setopt($curl, CURLOPT_PROXY, $proxy->ip.':'.$proxy->port);
        curl_setopt($curl, CURLOPT_PROXYTYPE, CURLPROXY_HTTP);


        /* proxy test */
        curl_setopt($curl, CURLOPT_RETURNTRANSFER, 1);
        curl_setopt($curl, CURLOPT_FOLLOWLOCATION, 1);
        curl_setopt($curl, CURLOPT_PROXYUSERPWD, $proxy->login.':'.$proxy->password);
        curl_setopt($curl, CURLOPT_SSL_VERIFYPEER, false);
        $auth = curl_exec($curl);
        if(is_null(json_decode($auth))) return Controller::curlExec($url);
        return json_decode($auth);
    }

    public function updateBalance($steamID64)
    {
        $user = User::where('steamid64', $steamID64)->first();
        if(is_null($user)) return;
        $this->redis->publish('updateBalance', json_encode([
            'user_id' => $user->id,
            'balance' => number_format($user->money, 0, ' ', ' ')
        ]));
    }
}
